TOKENRESPONSE1.txt

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body xmlns:ns1="http://service.gasws.dpw.com/">
        <ns1:getTokenDetails>
            <ns1:tokenReqType>
                <ns1:regPlace>DXB</ns1:regPlace>
                <ns1:rfIdNo></ns1:rfIdNo>
                <ns1:truckNo>405</ns1:truckNo>
                <ns1:terminalId>T1</ns1:terminalId>
                <ns1:userCredentials>
                    <ns1:password>XNmrh1j+uKQ=</ns1:password>
                    <ns1:username>CAMCOTST</ns1:username>
                </ns1:userCredentials>
            </ns1:tokenReqType>
        </ns1:getTokenDetails>
    </soap:Body>
</soap:Envelope>



<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns0="http://service.gasws.dpw.com/"><env:Body><ns0:getTokenDetailsResponse><ns0:return><ns0:exception xsi:nil="1"/><ns0:tokenDetails><ns0:tokenNo>300574</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>ENVS100306</ns0:containerNo><ns0:startTime>2024-04-23T13:44:02.000+04:00</ns0:startTime><ns0:endTime>2024-04-23T14:44:02.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>300663</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>ABC600</ns0:containerNo><ns0:startTime>2024-04-23T13:44:02.000+04:00</ns0:startTime><ns0:endTime>2024-04-23T14:44:02.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>300771</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>EXPO250805</ns0:containerNo><ns0:startTime>2021-08-26T11:30:00.000+04:00</ns0:startTime><ns0:endTime>2021-08-26T14:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>300772</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>EXBK250808</ns0:containerNo><ns0:startTime>2023-06-21T08:30:00.000+04:00</ns0:startTime><ns0:endTime>2023-06-21T12:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>300773</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>EXBK250811</ns0:containerNo><ns0:startTime>2024-04-23T13:44:02.000+04:00</ns0:startTime><ns0:endTime>2024-04-23T14:44:02.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>300774</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>EXBK250814</ns0:containerNo><ns0:startTime>2021-08-26T21:30:00.000+04:00</ns0:startTime><ns0:endTime>2021-08-27T00:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>300774</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>EXBK250813</ns0:containerNo><ns0:startTime>2021-08-26T21:30:00.000+04:00</ns0:startTime><ns0:endTime>2021-08-27T00:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>300785</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>EXPO310821</ns0:containerNo><ns0:startTime>2022-05-19T08:30:00.000+04:00</ns0:startTime><ns0:endTime>2022-05-19T12:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>300830</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>EMDT190921</ns0:containerNo><ns0:startTime>2022-04-15T07:30:00.000+04:00</ns0:startTime><ns0:endTime>2022-04-15T12:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>300938</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>EXBK191021</ns0:containerNo><ns0:startTime>2021-10-20T19:30:00.000+04:00</ns0:startTime><ns0:endTime>2021-10-20T22:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>300938</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>EXBK191022</ns0:containerNo><ns0:startTime>2021-10-20T19:30:00.000+04:00</ns0:startTime><ns0:endTime>2021-10-20T22:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>300939</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>EXBK191024</ns0:containerNo><ns0:startTime>2021-10-21T09:30:00.000+04:00</ns0:startTime><ns0:endTime>2021-10-21T12:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>300939</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>EXBK191023</ns0:containerNo><ns0:startTime>2021-10-21T09:30:00.000+04:00</ns0:startTime><ns0:endTime>2021-10-21T12:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>301053</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>ENVS161103</ns0:containerNo><ns0:startTime>2021-11-16T13:30:00.000+04:00</ns0:startTime><ns0:endTime>2021-11-16T16:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>301116</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>CNTR332123</ns0:containerNo><ns0:startTime>2021-11-29T17:30:00.000+04:00</ns0:startTime><ns0:endTime>2021-11-29T20:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>301496</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>EXPT100201</ns0:containerNo><ns0:startTime>2022-04-05T23:30:00.000+04:00</ns0:startTime><ns0:endTime>2022-04-06T02:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>301834</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>LISS1307060</ns0:containerNo><ns0:startTime>2022-06-24T20:30:00.000+04:00</ns0:startTime><ns0:endTime>2022-06-25T00:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>400093</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>LISS5423010</ns0:containerNo><ns0:startTime>2023-06-21T05:30:00.000+04:00</ns0:startTime><ns0:endTime>2023-06-21T09:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>400146</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>RLMT109222</ns0:containerNo><ns0:startTime>2022-09-01T07:30:00.000+04:00</ns0:startTime><ns0:endTime>2022-09-01T10:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>400299</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>EXPT960100</ns0:containerNo><ns0:startTime>2023-07-17T16:30:00.000+04:00</ns0:startTime><ns0:endTime>2023-07-17T22:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>475004</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>EXPT267233</ns0:containerNo><ns0:startTime>2023-08-07T04:30:00.000+04:00</ns0:startTime><ns0:endTime>2023-08-07T10:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>475004</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>EXPT267234</ns0:containerNo><ns0:startTime>2023-08-07T04:30:00.000+04:00</ns0:startTime><ns0:endTime>2023-08-07T10:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>475018</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>EXPR277231</ns0:containerNo><ns0:startTime>2023-07-29T04:30:00.000+04:00</ns0:startTime><ns0:endTime>2023-07-29T10:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>475018</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>EXPR277232</ns0:containerNo><ns0:startTime>2023-07-29T04:30:00.000+04:00</ns0:startTime><ns0:endTime>2023-07-29T10:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>500704</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>MTIN161025</ns0:containerNo><ns0:startTime>2023-10-17T05:30:00.000+04:00</ns0:startTime><ns0:endTime>2023-10-17T08:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>500704</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>MTIN161024</ns0:containerNo><ns0:startTime>2023-10-17T05:30:00.000+04:00</ns0:startTime><ns0:endTime>2023-10-17T08:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>501068</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>NOVR00063</ns0:containerNo><ns0:startTime>2023-11-25T10:30:00.000+04:00</ns0:startTime><ns0:endTime>2023-11-25T15:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>501705</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>EXPL800100</ns0:containerNo><ns0:startTime>2024-01-22T01:30:00.000+04:00</ns0:startTime><ns0:endTime>2024-01-22T04:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>501746</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>MTTE2216000</ns0:containerNo><ns0:startTime>2024-01-23T11:30:00.000+04:00</ns0:startTime><ns0:endTime>2024-01-23T14:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>502631</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>BXCH600100</ns0:containerNo><ns0:startTime>2024-04-23T09:30:00.000+04:00</ns0:startTime><ns0:endTime>2024-04-23T12:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>502631</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>BXCH600101</ns0:containerNo><ns0:startTime>2024-04-23T09:30:00.000+04:00</ns0:startTime><ns0:endTime>2024-04-23T12:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>502631</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>BXCH600102</ns0:containerNo><ns0:startTime>2024-04-23T09:30:00.000+04:00</ns0:startTime><ns0:endTime>2024-04-23T12:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>502639</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo xsi:nil="1"/><ns0:startTime>2024-04-23T21:30:00.000+04:00</ns0:startTime><ns0:endTime>2024-04-24T00:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>502640</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo xsi:nil="1"/><ns0:startTime>2024-04-23T11:30:00.000+04:00</ns0:startTime><ns0:endTime>2024-04-23T14:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>547765</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>LISS1502010</ns0:containerNo><ns0:startTime>2024-04-23T13:44:02.000+04:00</ns0:startTime><ns0:endTime>2024-04-23T14:44:02.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>548202</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>REFB400401</ns0:containerNo><ns0:startTime>2024-04-23T13:44:02.000+04:00</ns0:startTime><ns0:endTime>2024-04-23T14:44:02.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>548356</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>MTLD1552410</ns0:containerNo><ns0:startTime>2023-07-11T22:30:00.000+04:00</ns0:startTime><ns0:endTime>2023-07-12T04:29:59.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:tokenDetails><ns0:tokenNo>700753</ns0:tokenNo><ns0:terminalId>T1</ns0:terminalId><ns0:containerNo>KSAR1002010</ns0:containerNo><ns0:startTime>2024-04-23T13:44:02.000+04:00</ns0:startTime><ns0:endTime>2024-04-23T14:44:02.000+04:00</ns0:endTime></ns0:tokenDetails><ns0:errorMessage xsi:nil="1"/></ns0:return></ns0:getTokenDetailsResponse></env:Body></env:Envelope>






